base/Documents/бит_кзн_ПланируемоеПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_ПланируемоеПоступлениеДенежныхСредств</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаУпр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ДополнительныеУсловияПоДоговору</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуКлиенту</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПланированияОплатыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленНаСогласование</Name>
					<Comment>Признак того, что работа с документом завершена и он отправлен на согласование. Используется только в режиме "Проводить документы после утверждения".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Enums/бит_кзн_ВидыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_кзн_ВидыПланов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прогноз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_кзн_ПланируемоеПоступлениеДенежныхСредств/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	Параметры.Свойство("ВидПлана", ВидПлана);
	
	Если ЗначениеЗаполнено(ВидПлана) Тогда
		
		 // отбор прогнозов или заявок
		 Список.Отбор.Элементы.Очистить();
		 эо = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 эо.Использование  = Истина;
		 эо.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВидПлана");
		 эо.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		 эо.ПравоеЗначение = ВидПлана;
		 
	КонецЕсли; 
	
	// Колонка вид плана не нужна, если установлен отбор.
	Элементы.ВидПлана.Видимость = НЕ ЗначениеЗаполнено(ВидПлана);	
	
	// Формирование заголовка списка в зависимости от вида плана.
	Если ВидПлана = Перечисления.бит_кзн_ВидыПланов.Прогноз Тогда		
		ЭтотОбъект.Заголовок =  НСтр("ru='Прогнозы поступлений денежных средств';en='Cash flow projections'");		
	ИначеЕсли ВидПлана = Перечисления.бит_кзн_ВидыПланов.План Тогда		
		ЭтотОбъект.Заголовок =  НСтр("ru='Планируемые поступления денежных средств';en='Planned cash receipts'");		
	Иначе		
		ЭтотОбъект.Заголовок =  НСтр("ru='Документы планирования поступлений ДС';en='Documents planning DS receipts'");		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ВидПлана) Тогда	
		ЭтоПрогноз = ВидПлана = Перечисления.бит_кзн_ВидыПланов.Прогноз;		
		Элементы.ФормаДокументбит_кзн_ПланируемоеПоступлениеДенежныхСредствВвестиПланируемоеПоступленияДС.Видимость = ЭтоПрогноз;		
		Элементы.ФормаДокументбит_кзн_ПланируемоеПоступлениеДенежныхСредствСоздатьПлатежныеДокументы.Видимость = НЕ ЭтоПрогноз;		
	КонецЕсли; 
	
	МетаданныеОбъекта = Метаданные.Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств;

	// Добавление кнопки "Раскрасить по статусам"
	// Также добавляются процедуры: К-Подключаемый_РаскраситьПоСтатусам(), С-ОформитьСписокДокументовПоСтатусам().
	бит_РаботаСДиалогамиСервер.ДобавитьКнопкуРаскраситьПоСтатусам(Элементы, Команды, КоманднаяПанель,
																  МетаданныеОбъекта);
	ОформитьСписокДокументовПоСтатусам(Элементы.РаскраситьПоСтатусам.Пометка, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ Копирование И НЕ ЗначениеЗаполнено(ВидПлана) Тогда
		ПоказатьСписокВыбораПланов(Отказ);
	Иначе
		ОбработатьСписокПередНачаломДобавления(Копирование, Отказ);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

// Процедура назначается динамически действию кнопки командной панели 
// КоманднаяПанель.РаскраситьПоСтатусам
// (обработчик события "Нажатие" кнопки "РаскраситьПоСтатусам")
//
&НаКлиенте
Процедура Подключаемый_РаскраситьПоСтатусам()
	
	Элементы.РаскраситьПоСтатусам.Пометка = Не Элементы.РаскраситьПоСтатусам.Пометка;
	ОформитьСписокДокументовПоСтатусам(Элементы.РаскраситьПоСтатусам.Пометка);	
		
КонецПроцедуры // РаскраситьПоСтатусам()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура обновляет оформление списка документов по статусам
//
// Параметры:
//  ТолькоОчистить - Булево 
// 
&НаСервере
Процедура ОформитьСписокДокументовПоСтатусам(Знач ПометкаКн, Знач ЭтоОткрытие = Ложь) Экспорт

	Если ЭтоОткрытие И Не ПометкаКн Тогда
		Возврат;	
	КонецЕсли;
	
	МетаданныеОбъекта = Метаданные.Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств;	
	
	МасОбъектов = ?(ПометкаКн, бит_РаботаСДиалогамиСервер.ПолучитьМассивОбъектов(МетаданныеОбъекта), Новый Массив);
	бит_РаботаСДиалогамиСервер.ОформитьСписокДокументовПоСтатусам(МасОбъектов, ПометкаКн, УсловноеОформление);
	
	Если НЕ ЭтоОткрытие Тогда
		РегистрыСведений.бит_СохраненныеЗначения.СохранитьЗнч(Пользователи.ТекущийПользователь(),
			МетаданныеОбъекта,"РаскраситьПоСтатусам_Пометка",ПометкаКн);
	КонецЕсли;
															
КонецПроцедуры // ОформитьСписокДокументовПоСтатусам()

&НаКлиенте
Процедура ПоказатьСписокВыбораПланов(Отказ)
	
	СписокВидовПлана = Новый СписокЗначений;
	СписокВидовПлана.Добавить(ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.Прогноз"),  
								НСтр("ru='Прогноз платежа';en='Payment Forecast'"));
	СписокВидовПлана.Добавить(ПредопределенноеЗначение("Перечисление.бит_кзн_ВидыПланов.План"), 
								НСтр("ru='Заявка на расходование ДС';en='Request for Disbursement'"));
	
	ЗаголовокДиалога = НСтр("ru='Выберите вид документа';en='Select the type of document'");
	Дополнительно 	 = Новый Структура("Отказ", Отказ);
	Оповещение 		 = Новый ОписаниеОповещения("ПоказатьСписокВыбораПлановЗавершение", ЭтотОбъект, Дополнительно);
	
	СписокВидовПлана.ПоказатьВыборЭлемента(Оповещение, ЗаголовокДиалога);						  	
	
КонецПроцедуры

// Обработчик завершения открытия формы списка значений.
//  См. Синтакс-помощник: ПоказатьВыборЭлемента().
//
&НаКлиенте
Процедура ПоказатьСписокВыбораПлановЗавершение(Результат, Дополнительно) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;	
	
	ВидПлана = Результат.Значение;

	ОбработатьСписокПередНачаломДобавления(Ложь, Дополнительно.Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСписокПередНачаломДобавления(Копирование, Отказ)
	
	Если НЕ Копирование Тогда
		Отказ			   = Истина;
		ЗначенияЗаполнения = Новый Структура("ВидПлана", ВидПлана);
				
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.бит_кзн_ПозицияПоступления.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	Иначе	
		ПараметрыФормыПозиции = ПараметрыФормыПриКопировании(Элементы.Список.ТекущаяСтрока);
		Если ПараметрыФормыПозиции.КоличествоПозиций = 1 Тогда
			Отказ = Истина;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыФормыПозиции.ЗначенияЗаполнения);
			ОткрытьФорму("Документ.бит_кзн_ПозицияПоступления.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция ПараметрыФормыПриКопировании(ДокументПланирования)
	
	Возврат Документы.бит_кзн_ПозицияПоступления.ПараметрыФормыПриКопировании(ДокументПланирования);
	
КонецФункции

#КонецОбласти
